/*
	File:		SlicesStrings.strings

	Contains:
	Copyright:	© 2007-2009 by Apple Inc., all rights reserved.
*/

//===========================================================================
// NOTE FOR LOCALIZERS:
// For any attributes overridden using the MDSlicesAttributeNameOverrides
// strings file, special care must be taken here. The KEY of the strings
// here will change from its english version to the name override.  For example:
//
// If MDSlicesAttributeNameOverrides.strings contains:
//		kMDItemTextContent = "TEXTCONTENT";
//
// Then replace any use of "Contents" (the english localization) in the KEYS
// of this file with the localization provided in MDSlicesAttributeNameOverrides.strings.
//
// In the above example, the localizer should change the text content localization below from:
//		"%[Contents]@ contains %@" = "%1$[Contents]@ contains %2$@";  // english version
//	to:
//		"%[TEXTCONTENT]@ contains %@" = "%1$[TEXTCONTENT]@ xxxxxx %2$@"; // localized version
//===========================================================================

/* Compound-type slices */
"%[Any]@ of the following are true" = "%1$[Något]@ av följande är sant";
"%[All]@ of the following are true" = "%1$[Allt]@ av följande är sant";
"%[None]@ of the following are true" = "%1$[Inget]@ av följande är sant";

/* Specific kind strings */
"%[Kind]@ is %[any]@" = "%1$[Typ]@ är %2$[alla]@";
"%[Kind]@ is %[applications]@" = "%1$[Typ]@ är %2$[program]@";
"%[Kind]@ is %[documents]@" = "%1$[Typ]@ är %2$[dokument]@";
"%[Kind]@ is %[folders]@" = "%1$[Typ]@ är %2$[mapp]@";
"%[Kind]@ is %[images]@ %[all]@" = "%1$[Typ]@ är %2$[bild]@ %3$[alla]@";
"%[Kind]@ is %[images]@ %[JPEG]@" = "%1$[Typ]@ är %2$[bild]@ %3$[JPEG]@";
"%[Kind]@ is %[images]@ %[TIFF]@" = "%1$[Typ]@ är %2$[bild]@ %3$[TIFF]@";
"%[Kind]@ is %[images]@ %[GIF]@" = "%1$[Typ]@ är %2$[bild]@ %3$[GIF]@";
"%[Kind]@ is %[images]@ %[PNG]@" = "%1$[Typ]@ är %2$[bild]@ %3$[PNG]@";
"%[Kind]@ is %[images]@ %[BMP]@" = "%1$[Typ]@ är %2$[bild]@ %3$[BMP]@";
"%[Kind]@ is %[music]@ %[all]@" = "%1$[Typ]@ är %2$[musik]@ %3$[alla]@";
"%[Kind]@ is %[music]@ %[MP3]@" = "%1$[Typ]@ är %2$[musik]@ %3$[MP3]@";
"%[Kind]@ is %[music]@ %[AAC]@" = "%1$[Typ]@ är %2$[musik]@ %3$[AAC]@";
"%[Kind]@ is %[music]@ %[purchased]@" = "%1$[Typ]@ är %2$[musik]@ %3$[inköpt]@";
"%[Kind]@ is %[PDF]@" = "%1$[Typ]@ är %2$[PDF]@";
"%[Kind]@ is %[presentations]@" = "%1$[Typ]@ är %2$[presentation]@";
"%[Kind]@ is %[text]@ %[all]@" = "%1$[Typ]@ är %2$[text]@ %3$[alla]@";
"%[Kind]@ is %[text]@ %[plain text]@" = "%1$[Typ]@ är %2$[text]@ %3$[ren text]@";
"%[Kind]@ is %[text]@ %[rich text]@" = "%1$[Typ]@ är %2$[text]@ %3$[formaterad text]@";
"%[Kind]@ is %[text]@ %[HTML]@" = "%1$[Typ]@ är %2$[text]@ %3$[HTML]@";
"%[Kind]@ is %[text]@ %[XML]@" = "%1$[Typ]@ är %2$[text]@ %3$[XML]@";
"%[Kind]@ is %[text]@ %[source code]@" = "%1$[Typ]@ är %2$[text]@ %3$[källkod]@";
"%[Kind]@ is %[movies]@" = "%1$[Typ]@ är %2$[film]@";
"%[Kind]@ is %[other]@ %@" = "%1$[Typ]@ är %2$[annan]@ %3$@";

/* date-type attribute template, like kMDItemContentCreationDate */
"%@ is %[within last]@ %@ %[days]@" = "%1$@ är %2$[inom de senaste]@ %3$@ %4$[dagarna]@";
"%@ is %[within last]@ %@ %[weeks]@" = "%1$@ är %2$[inom de senaste]@ %3$@ %4$[veckorna]@";
"%@ is %[within last]@ %@ %[months]@" = "%1$@ är %2$[inom de senaste]@ %3$@ %4$[månaderna]@";
"%@ is %[within last]@ %@ %[years]@" = "%1$@ är %2$[inom de senaste]@ %3$@ %4$[åren]@";
"%@ is %[exactly]@ %@" = "%1$@ är %2$[exakt]@ %3$@";
"%@ is %[before]@ %@" = "%1$@ är %2$[före]@ %3$@";
"%@ is %[after]@ %@" = "%1$@ är %2$[efter]@ %3$@";
"%@ is %[today]@" = "%1$@ är %2$[idag]@";
"%@ is %[yesterday]@" = "%1$@ är %2$[igår]@";
"%@ is %[this week]@" = "%1$@ är %2$[den här veckan]@";
"%@ is %[this month]@" = "%1$@ är %2$[den här månaden]@";
"%@ is %[this year]@" = "%1$@ är %2$[i år]@";

/* string-type attribute, like kMDItemDisplayName */
"%@ %[contains]@ %@" = "%1$@ %2$[Innehåller]@ %3$@";
"%@ %[begins with]@ %@" = "%1$@ %2$[Börjar med]@ %3$@";
"%@ %[ends with]@ %@" = "%1$@ %2$[Slutar med]@ %3$@";
"%@ %[is]@ %@" = "%1$@ %2$[är]@ %3$@";
"%@ %[matches]@ %@" = "%1$@ %2$[matchar]@ %3$@";

/* boolean-type attribute, like kMDItemFlashOnOff */
"%@ %[any]@" = "%1$@ %2$[Alla]@";
"%@ %[yes]@" = "%1$@ %2$[Ja]@";
"%@ %[no]@" = "%1$@ %2$[Nej]@";

/* file visibility */
"%[File invisible]@ %[visible items]@" = "%1$[Filsynlighet]@ %2$[Synliga objekt]@";
"%[File invisible]@ %[invisible items]@" = "%1$[Filsynlighet]@ %2$[Osynliga objekt]@";
"%[File invisible]@ %[visible or invisible]@" = "%1$[Filsynlighet]@ %2$[Synliga eller osynliga]@";

/* raw query slice */
"%[Raw query]@ %@" = "%1$[Råsökning]@ %2$@";

/* file extension slice */
"%[File Extension]@ %[is]@ %@" = "%1$[Filtillägg]@ %2$[är]@ %3$@";

/* number-type attribute, like kMDItemAudioChannelCount */
"%@ %[equals]@ %@" = "%1$@ %2$[är]@ %3$@";
"%@ %[is greater than]@ %@" = "%1$@ %2$[är större än]@ %3$@";
"%@ %[is less than]@ %@" = "%1$@ %2$[är mindre än]@ %3$@";
"%@ %[is not]@ %@" = "%1$@ %2$[är inte]@ %3$@";

/* text contents */
"%@ contains %@" = "%1$@ innehåller %2$@";

/* Byte-sized attributes, such as kMDItemFSSize */
"%@ %[equals]@ %@ %[KB]@" = "%1$@ %2$[är]@ %3$@ %4$[K]@";
"%@ %[equals]@ %@ %[MB]@" = "%1$@ %2$[är]@ %3$@ %4$[MB]@";
"%@ %[equals]@ %@ %[GB]@" = "%1$@ %2$[är]@ %3$@ %4$[GB]@";
"%@ %[is less than]@ %@ %[KB]@" = "%1$@ %2$[är mindre än]@ %3$@ %4$[K]@";
"%@ %[is less than]@ %@ %[MB]@" = "%1$@ %2$[är mindre än]@ %3$@ %4$[MB]@";
"%@ %[is less than]@ %@ %[GB]@" = "%1$@ %2$[är mindre än]@ %3$@ %4$[GB]@";
"%@ %[is greater than]@ %@ %[KB]@" = "%1$@ %2$[är större än]@ %3$@ %4$[K]@";
"%@ %[is greater than]@ %@ %[MB]@" = "%1$@ %2$[är större än]@ %3$@ %4$[MB]@";
"%@ %[is greater than]@ %@ %[GB]@" = "%1$@ %2$[är större än]@ %3$@ %4$[GB]@";
"%@ %[is not]@ %@ %[KB]@" = "%1$@ %2$[är inte]@ %3$@ %4$[K]@";
"%@ %[is not]@ %@ %[MB]@" = "%1$@ %2$[är inte]@ %3$@ %4$[MB]@";
"%@ %[is not]@ %@ %[GB]@" = "%1$@ %2$[är inte]@ %3$@ %4$[GB]@";

/* Duration-type attributes, such as kMDItemDurationSeconds */
"%@ %[equals]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[är]@ %3$@ timmar %4$@ minuter %5$@ sekunder";
"%@ %[is less than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[är mindre än]@ %3$@ timmar %4$@ minuter %5$@ sekunder";
"%@ %[is greater than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[är större än]@ %3$@ timmar %4$@ minuter %5$@ sekunder";
"%@ %[is not]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[är inte]@ %3$@ timmar %4$@ minuter %5$@ sekunder";

/* This is for the slice that is added when a search string is present in the search field when saving a search. */
"%[Items matching text]@ %@" = "%1$[Objekt med likadan text]@ %2$@";

/* Search System Files slice */
"%[SEARCH_SYSTEM_FILES]@ %[YES]@" = "%1$[Systemfiler]@ %2$[är inkluderade]@";
"%[SEARCH_SYSTEM_FILES]@ %[NO]@" = "%1$[Systemfiler]@ %2$[är inte inkluderade]@";

/* Spotlight items slice */
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[YES]@" = "%1$[Spotlight-objekt]@ %2$[är inkluderade]@";
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[NO]@" = "%1$[Spotlight-objekt]@ %2$[är inte inkluderade]@";

